app/controllers/bid_items_controller.rb

  def search
    if params[:search].present?
      # This is for the elastic search
      #@bid_items = BidItem.search(params[:search])

      # Those are Ruby SQL queries
      # This is to search item_name
      #@bid_items = BidItem.where(:item_name => params[:search])
      # This is to search price larger than
      @bid_items = BidItem.where("starting_price > ?", params[:search])
    else
      @bid_items = BidItem.all
---
SELECT "bid_items".* FROM "bid_items" WHERE "bid_items"."starting_price" = ?  [["starting_price", 1]]
SELECT "bid_items".* FROM "bid_items"

  def index
    @bid_items = BidItem.all
---
SELECT `bid_items`.* FROM `bid_items`

  def show
    @bid_records = BidRecord.where(bid_item_id: @bid_item).order("created_at DESC")
---
SELECT "bid_records".* FROM "bid_records" WHERE "bid_records"."bid_item_id" = 1 ORDER BY created_at DESC

  def create
    @bid_item = BidItem.new(bid_item_params)
    @bid_item.seller_id = current_user.id
    @bid_item.current_price = @bid_item.starting_price
    respond_to do |format|
      if @bid_item.save
---
INSERT INTO "bid_items" ("item_name", "starting_price", "seller_id", "description", "created_at", "updated_at", "fixed_price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_name", "1"], ["starting_price", 1], ["seller_id", 1], ["description", ""], ["created_at", 2016-10-26 22:40:40 UTC], ["updated_at", 2016-10-26 22:40:40 UTC], ["fixed_price", 1]]

  def update
    respond_to do |format|
      if @bid_item.update(bid_item_params)
---
UPDATE "bid_items" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "bid_items"."id" = ?  [["image_file_name", "cat.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 9818], ["image_updated_at", 2016-10-18 21:28:20 UTC], ["updated_at", 2016-10-18 21:28:20 UTC], ["id", 6]]

  def destroy
    @bid_item.destroy
---
DELETE FROM "bid_items" WHERE "bid_items"."id" = ?  [["id", 1]]

    def set_bid_item
      @bid_item = BidItem.find(params[:id])
---
SELECT  "bid_items".* FROM "bid_items" WHERE "bid_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]