app/controllers/bid_records_controller.rb

INSERT INTO "bid_records" ("price", "user_id", "bid_item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 124], ["user_id", 1], ["bid_item_id", 1], ["created_at", 2016-10-29 22:11:34 UTC], ["updated_at", 2016-10-29 22:11:34 UTC]]
---
	def create
		@bid_record = BidRecord.new(record_params)
		@bid_record.user_id = current_user.id
		@bid_record.bid_item_id = @bid_item.id
		respond_to do |format|
			if @bid_record.price < @bid_item.current_price
				format.html {redirect_to @bid_item, notice: 'Your price must be greater than current price.' }
			else
				if @bid_record.save

SELECT  "bid_items".* FROM "bid_items" WHERE "bid_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_item
      @bid_item = BidItem.find(params[:bid_item_id])