app/controllers/communities_controller.rb

SELECT "user_communities".* FROM "user_communities" WHERE "user_communities"."community_id" = ?  [["community_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bid_items".* FROM "bid_items" WHERE "bid_items"."seller_id" = ?  [["seller_id", 1]]
---
  def show
    @users = []
    @community.user_communities.each do |uc|
      @users << User.find(uc.user_id)
      # @users << uc
    end

    # @items = []
    # @users.each do |user|
    #   @item = BidItem.where(:seller_id => user.id)
    #   @item.each do |item|
    #     @items << item
    #   end
    # end

    @items = BidItem.where(seller_id: @users).limit(30)

INSERT INTO "communities" ("name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "UCSB"], ["location", "CA"], ["created_at", 2016-10-27 03:06:49 UTC], ["updated_at", 2016-10-27 03:06:49 UTC]]
---
  def create
    @community = Community.new(community_params)

    respond_to do |format|
      if @community.save

INSERT INTO "user_communities" ("community_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["community_id", 1], ["user_id", 1], ["created_at", 2016-10-27 04:00:09 UTC], ["updated_at", 2016-10-27 04:00:09 UTC]]
---
  def join
    set_community
    @m = @community.user_communities.build(:community_id => @community.id,:user_id => current_user.id)
    respond_to do |format|
      if @m.save

SELECT  "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_community
      @community = Community.find(params[:id])