app/controllers/user_communities_controller.rb

    def set_community
      @community = Community.find(params[:id])
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]